// Ukrainian for Chaos Space Marines detachments (part 1). Keys are "<detachment file stem>/<name>".
export const RULES = {
  "cabal-of-chaos/Empyric Wellspring":
    "Щоразу, коли підрозділ з вашої армії здійснює Dark Pact, оберіть одну з наведених нижче здатностей. Ваш підрозділ має цю здатність до кінця фази. \n\n\n**Leaping Warpflame**\nПоки цей підрозділ перебуває в межах 9\" від однієї або більше дружніх моделей ^^**Heretic Astartes Psyker^^**, покращуйте характеристику Strength дальньої зброї, якою озброєні моделі цього підрозділу, на 1. \n\n\n**Monstrous Manifestation**\nПоки цей підрозділ перебуває в межах 9\" від однієї або більше дружніх моделей ^^**Heretic Astartes Daemon Prince^^** або ^^**Heretic Astartes Daemon Prince with Wings^^**, покращуйте характеристику Armour Penetration зброї ближнього бою, якою озброєні моделі цього підрозділу, на 1.",
  "chaos-cult/Desperate Devotion":
    "Щоразу, коли підрозділ ^^**Damned**^^ з вашої армії зі здатністю Dark Pacts обирається для здійснення Normal або Advance move чи оголошення charge (за винятком підрозділів, що прибули з Reserves цього ходу), він може здійснити Desperate Pact. Якщо так, до кінця фази додайте 2\" до характеристики Move моделей цього підрозділу та додайте 2 до Charge rolls, які здійснюються для цього підрозділу.\n\n\nDesperate Pacts\nЩоразу, коли підрозділ здійснює Desperate Pact, він спочатку повинен пройти Leadership test; якщо цей test провалено, підрозділ отримує D3 mortal wounds до того, як розв'язуються будь-які ефекти Desperate Pact.",
  "creations-of-bile/Creations of Bile":
    "На початку бою оберіть, які augmentations активні для моделей ^^**Heretic Astartes Infantry**^^ (за винятком моделей ^^**Damned**^^) з вашої армії до кінця бою. Для цього або оберіть одну зі списку нижче, або випадково визначте дві, кинувши два D6. Якщо ^^**Fabius Bile**^^ — ваш ^^**Warlord**^^, під час випадкового визначення ваших augmentations ви можете перекинути один або обидва кубики. Повторювані augmentations не мають додаткового ефекту.\n\n\n1 - **Cholinergic Accelerants:** Додайте 1 до характеристики Attacks зброї ближнього бою, якою озброєна ця модель.\n2 - **Hyperadrenal Infusion:** Додайте 2\" до характеристики Move цієї моделі.\n3 - **Paraneural Reactions:** Покращуйте характеристику Weapon Skill зброї ближнього бою, якою озброєна ця модель, на 1.\n4 - **Supracutaneous Chitination:** Покращуйте характеристику Toughness цієї моделі на 1.\n5 - **Macrotensile Sinews:** Додайте 1 до характеристики Strength зброї ближнього бою, якою озброєна ця модель.\n6 - **Ophthalmic Enhancement:** Покращуйте характеристику Ballistic Skill дальньої зброї, якою озброєна ця модель, на 1.",
  "cult-of-the-arkifane/Soul Forge Boons":
    "Підрозділи ^^**Heretic Astartes Vehicle^^** з вашої армії отримують keyword ^^**Daemon^^**. \nПідрозділи ^^**Heretic Astartes Vehicle, Lord Discordant^^** та ^^**Vashtorr the Arkifane^^** з вашої армії отримують keyword ^^**Soul Forge^^**. \nПідрозділи ^^**Soul Forge^^** з вашої армії мають 5+ invulnerable save.",
  "deceptors/Masters of Misdirection":
    "На кроці Declare Battle Formations ви можете обрати певну кількість підрозділів ^^**Legionaries**^^ та ^^**Cultist Mob**^^ з вашої армії; до кінця бою ці підрозділи та будь-які підрозділи ^^**Character**^^, attached до них (за винятком ^^**Epic Heroes**^^), мають здатність Infiltrator. Максимальна кількість підрозділів, яку ви можете обрати таким чином, залежить від розміру бою, як показано нижче.\n\n\n**Battle Size | Legionaries | Cultist Mobs**\nIncursion | До 2 підрозділів | До 2 підрозділів\nStrike Force | До 3 підрозділів | До 3 підрозділів\nOnslaught | До 4 підрозділів | До 4 підрозділів",
  "dread-talons/Terror Descends (Aura)":
    "На кроці Battle-shock у Command phase вашого опонента, якщо ворожий підрозділ, що перебуває нижче своєї Starting Strength, перебуває в межах 12\" від одного або більше підрозділів ^^**Heretic Astartes**^^ з вашої армії, цей ворожий підрозділ повинен пройти Battle-shock test.\nЩоразу, коли ворожий підрозділ у межах 12\" від одного або більше підрозділів ^^**Heretic Astartes**^^ з вашої армії проходить Battle-shock test, віднімайте 1 від результату.\nВорожі підрозділи, на які діє це Detachment rule, не повинні проходити жодних інших Battle-shock tests у цій самій фазі.",
  "fellhammer-siege-host/Iron Fortitude":
    "Щоразу, коли дальня атака спрямована на підрозділ ^^**Heretic Astartes**^^ з вашої армії (за винятком підрозділів ^^**Damned**^^), якщо характеристика Strength цієї атаки більша за характеристику Toughness цього підрозділу, віднімайте 1 від Wound roll.",
};
export const STRATAGEMS = {
  "cabal-of-chaos/Shroud Of Chaos":
    "ЦІЛЬ: Один підрозділ Heretic Astartes Psyker, Heretic Astartes Daemon Prince або Heretic Astartes Daemon Prince with Wings з вашої армії.\n\nЕФЕКТ: До кінця фази ваш підрозділ має таку здатність:\n\nShroud of Chaos (Aura): Моделі дружніх підрозділів HERETIC ASTARTES у межах 6\" від цього підрозділу мають здатність Stealth.",
  "cabal-of-chaos/Unholy Haste":
    "ЦІЛЬ: Один підрозділ Heretic Astartes Infantry з вашої армії, що не був обраний для оголошення charge цієї фази.\n\nЕФЕКТ: До кінця фази ваш підрозділ має право оголошувати charge в хід, коли він здійснив Advance.",
  "cabal-of-chaos/Baleful Blessing":
    "ЦІЛЬ: Цей підрозділ HERETIC ASTARTES.\n\nЕФЕКТ: До кінця фази моделі вашого підрозділу мають здатність Feel No Pain 5+ проти mortal wounds.",
  "cabal-of-chaos/Soulseekers":
    "ЦІЛЬ: Один підрозділ Heretic Astartes з вашої армії, що не був обраний для стрільби цієї фази.\n\nЕФЕКТ: До кінця фази дальня зброя, якою озброєні моделі вашого підрозділу, має здатність [IGNORES COVER].",
  "cabal-of-chaos/No Rest In Death":
    "ЦІЛЬ: Один підрозділ Heretic Astartes з вашої армії в межах 9\" від підрозділу Heretic Astartes Psyker, Heretic Astartes Daemon Prince або Heretic Astartes Daemon Prince with Wings з вашої армії.\n\nЕФЕКТ: Одна модель вашого підрозділу відновлює до D3+1 втрачених wounds. Якщо ваш підрозділ має keyword Battleline, ви можете натомість повернути до D3 знищених моделей (за винятком моделей Character) до вашого підрозділу з повною кількістю wounds.",
  "cabal-of-chaos/Mutation's Curse":
    "ЦІЛЬ: Один підрозділ Heretic Astartes Psyker з вашої армії.\n\nЕФЕКТ: Оберіть один видимий ворожий підрозділ у межах 12\" від вашого підрозділу. Киньте один D6: на 1 цей ворожий підрозділ отримує 1 mortal wound; на 2-4 цей ворожий підрозділ отримує D3 mortal wounds; на 5-6 цей ворожий підрозділ отримує 2D3 mortal wounds.",
  "chaos-cult/Crazed Focus":
    "ЦІЛЬ: Один підрозділ DAMNED з вашої армії, що не був обраний для стрільби цієї фази.\n\nЕФЕКТ: Ваш підрозділ може здійснити Desperate Pact. Якщо так, до кінця фази щоразу, коли модель вашого підрозділу здійснює атаку, покращуйте характеристику Armour Penetration цієї атаки на 1, а якщо ваш підрозділ не провалив відповідний Leadership test під час здійснення цього Desperate Pact, також покращуйте характеристику Strength цієї атаки на 1.",
  "chaos-cult/Infernal Sacrifice":
    "ЦІЛЬ: Один підрозділ DAMNED з вашої армії, що не був обраний для бою цієї фази.\n\nЕФЕКТ: Ваш підрозділ може здійснити Desperate Pact. Якщо так, ваш підрозділ отримує D3 mortal wounds (на додаток до будь-яких, отриманих за провал відповідного Leadership test), і до кінця фази додайте 1 до характеристики Attacks зброї ближнього бою, якою озброєні моделі вашого підрозділу, а якщо ваш підрозділ не провалив відповідний Leadership test під час здійснення цього Desperate Pact, до кінця фази також покращуйте характеристику Strength цієї зброї на 1.",
  "chaos-cult/Chosen For Glory":
    "ЦІЛЬ: Один підрозділ DAMNED з вашої армії, що не був обраний для стрільби чи бою цієї фази.\n\nЕФЕКТ: Ваш підрозділ може здійснити Desperate Pact. Якщо так, до кінця фази щоразу, коли модель вашого підрозділу здійснює атаку, ви можете перекинути Hit roll, а якщо ваш підрозділ не провалив відповідний Leadership test під час здійснення цього Desperate Pact, ви також можете перекинути Wound roll.",
  "chaos-cult/Mortal Thralls":
    "ЦІЛЬ: Один підрозділ HERETIC ASTARTES з вашої армії, що був обраний ціллю однієї або більше атак атакуючого підрозділу, і один дружній підрозділ DAMNED у межах 3\" від вашого підрозділу, видимий як вашому підрозділу, так і атакуючому підрозділу.\n\nЕФЕКТ: До кінця фази, поки ваш підрозділ DAMNED перебуває на полі бою, щоразу, коли ваш опонент мав би здійснити Wound roll для атаки, спрямованої на ваш підрозділ HERETIC ASTARTES, якщо ваш підрозділ DAMNED видимий атакуючій моделі та є прийнятною ціллю для цієї атаки, roll не здійснюється; натомість ваш підрозділ DAMNED отримує кількість mortal wounds, що дорівнює характеристиці Damage цієї атаки.",
  "chaos-cult/Reckless Haste":
    "ЦІЛЬ: Один підрозділ DAMNED з вашої армії.\n\nЕФЕКТ: До кінця ходу ваш підрозділ має право оголошувати charge в хід, коли він здійснив Advance.",
  "chaos-cult/Selfless Demise":
    "ЦІЛЬ: Один підрозділ DAMNED з вашої армії, що був обраний ціллю однієї або більше атак атакуючого підрозділу.\n\nЕФЕКТ: Доки атакуючий підрозділ не розв'яже всі свої атаки, щоразу, коли модель вашого підрозділу знищується, киньте один D6: на 6 атакуючий підрозділ отримує 1 mortal wound після того, як усі його атаки розв'язано.",
  "creations-of-bile/Masters Are Watching":
    "ЦІЛЬ: Один підрозділ Heretic Astartes Infantry з вашої армії, що був обраний ціллю однієї або більше атак атакуючого підрозділу.\n\nЕФЕКТ: До кінця фази щоразу, коли модель вашого підрозділу знищується, якщо ця модель ще не билася цієї фази, киньте один D6, віднімаючи 1 від результату, якщо це підрозділ Damned: на 4+ не прибирайте її з гри. Ця знищена модель може вступити в бій після того, як атакуючий підрозділ завершить здійснення своїх атак, а потім прибирається з гри.",
  "creations-of-bile/Autostimulants":
    "ЦІЛЬ: Один підрозділ Heretic Astartes Infantry з вашої армії.\n\nЕФЕКТ: До кінця ходу ваш підрозділ має право оголошувати charge в хід, коли він здійснив Advance.",
  "creations-of-bile/Delayed Mutations":
    "ЦІЛЬ: Один підрозділ Heretic Astartes Infantry (за винятком підрозділів Damned) з вашої армії.\n\nЕФЕКТ: Ваш підрозділ отримує D3 mortal wounds. Потім оберіть одну augmentation (див. Experimental Augmentations). До початку вашої наступної Command phase моделі вашого підрозділу мають обрану augmentation на додаток до будь-яких інших augmentations, які вони мають.",
  "creations-of-bile/Specimens For The Spider":
    "ЦІЛЬ: Один підрозділ Heretic Astartes Infantry з вашої армії, що не був обраний для бою цієї фази.\n\nЕФЕКТ: До кінця фази щоразу, коли модель вашого підрозділу здійснює атаку ближнього бою, спрямовану на підрозділ CHARACTER, ви можете перекинути Wound roll. Після того, як ваш підрозділ бився, якщо одну або більше ворожих моделей CHARACTER було знищено в результаті цих атак, оберіть один ворожий підрозділ у межах 6\" від вашого підрозділу. Цей ворожий підрозділ повинен пройти Battle-shock test. Якщо в результаті цих атак було знищено ворожого WARLORD, натомість кожен ворожий підрозділ у межах 6\" від вашого підрозділу повинен пройти Battle-shock test.",
  "creations-of-bile/Monstrous Visages":
    "ЦІЛЬ: Один підрозділ Heretic Astartes Infantry з вашої армії, що був обраний ціллю однієї або більше атак атакуючого підрозділу.\n\nЕФЕКТ: До кінця фази щоразу, коли атака спрямована на ваш підрозділ, віднімайте 1 від Hit roll.",
  "creations-of-bile/Diabolic Regeneration":
    "ЦІЛЬ: Один підрозділ Heretic Astartes Infantry (за винятком підрозділів Damned) з вашої армії.\n\nЕФЕКТ: Одна знищена модель (за винятком моделей Character) повертається до вашого підрозділу. Якщо ваш підрозділ — підрозділ Battleline, натомість до вашого підрозділу повертаються D3 знищених моделей (за винятком моделей CHARACTER).",
  "cult-of-the-arkifane/Touch Of The Arkifane":
    "ЦІЛЬ: Один підрозділ HERETIC ASTARTES з вашої армії (за винятком підрозділів Damned), що не був обраний для стрільби чи бою цієї фази.\n\nЕФЕКТ: До кінця фази, якщо ваш підрозділ обрано для здійснення Dark Pact, ви можете обрати обидві здатності, які отримає зброя цього підрозділу.",
  "cult-of-the-arkifane/Balefire Boon":
    "ЦІЛЬ: Один підрозділ Soul Forge з вашої армії, що не був обраний для стрільби чи бою цієї фази.\n\nЕФЕКТ: До кінця фази щоразу, коли модель вашого підрозділу здійснює атаку, покращуйте характеристику Armour Penetration цієї атаки на 1.",
  "cult-of-the-arkifane/Soul-Tally Offering":
    "ЦІЛЬ: Один підрозділ Soul Forge з вашої армії, що не був обраний для стрільби чи бою цієї фази.\n\nЕФЕКТ: До кінця фази щоразу, коли модель вашого підрозділу здійснює атаку, спрямовану на підрозділ CHARACTER, MONSTER або VEHICLE, ви можете перекинути Wound roll.",
  "cult-of-the-arkifane/Biomechanoid Regeneration":
    "ЦІЛЬ: Один підрозділ HERETIC ASTARTES з вашої армії (за винятком підрозділів Damned).\n\nЕФЕКТ: Одна модель вашого підрозділу відновлює до D3 втрачених wounds. Якщо ваш підрозділ має keyword Soul Forge, натомість одна модель вашого підрозділу відновлює до 3 втрачених wounds.",
  "cult-of-the-arkifane/Forge-Fire Surge":
    "ЦІЛЬ: Цей підрозділ HERETIC ASTARTES.\n\nЕФЕКТ: До кінця ходу ваш підрозділ має право стріляти в хід, коли він здійснив Advance. Якщо ваш підрозділ має keyword Soul Forge, до кінця ходу ваш підрозділ натомість має право стріляти та оголошувати charge в хід, коли він здійснив Advance.",
  "cult-of-the-arkifane/Unholy Fortitude":
    "ЦІЛЬ: Один підрозділ Soul Forge з вашої армії, що був обраний ціллю однієї або більше атак атакуючого підрозділу.\n\nЕФЕКТ: До кінця фази додайте 1 до характеристики Toughness моделей вашого підрозділу.",
  "deceptors/Pick Them Off":
    "ЦІЛЬ: Один підрозділ HERETIC ASTARTES з вашої армії, що не був обраний для стрільби цієї фази.\n\nЕФЕКТ: До кінця фази щоразу, коли модель вашого підрозділу здійснює атаку, спрямовану на підрозділ, що перебуває нижче своєї Starting Strength, ви можете перекинути Hit roll. Якщо ціль Below Half-strength, ви також можете перекинути Wound roll.",
  "deceptors/From All Sides":
    "ЦІЛЬ: Один підрозділ HERETIC ASTARTES з вашої армії.\n\nЕФЕКТ: До кінця фази додайте 1 до Charge rolls, які здійснюються для вашого підрозділу, за кожен інший підрозділ HERETIC ASTARTES з вашої армії, що здійснив Charge move цієї фази (максимум +3)",
  "deceptors/Coils Of Deception":
    "ЦІЛЬ: Цей підрозділ HERETIC ASTARTES.\n\nЕФЕКТ: До кінця ходу ваш підрозділ має право стріляти в хід, коли він здійснив Fell Back",
  "deceptors/Scrambled Coordinates":
    "ЦІЛЬ: Один підрозділ HERETIC ASTARTES з вашої армії.\n\nЕФЕКТ: До кінця фази ворожі підрозділи, що розставляються на полі бою з Reserves, не можуть бути розставлені в межах 12\" по горизонталі від вашого підрозділу.",
  "deceptors/Relentless Pursuit":
    "ЦІЛЬ: Один підрозділ HERETIC ASTARTES INFANTRY або HERETIC ASTARTES MOUNTED з вашої армії, що перебуває в межах 9\" від цього ворожого підрозділу і не перебуває в межах Engagement Range одного або більше ворожих підрозділів.\n\nЕФЕКТ: Ваш підрозділ може здійснити Normal move до 6\".",
  "deceptors/Detonator":
    "ЦІЛЬ: Один підрозділ HERETIC ASTARTES CHARACTER з вашої армії, що перебував у межах 18\" від цієї ворожої моделі, коли її було знищено.\n\nЕФЕКТ: Ваш опонент не кидає кубики, щоб визначити, чи завдаються mortal wounds здатністю Deadly Demise його моделі. Натомість mortal wounds завдаються автоматично (якщо ця здатність завдає випадкову кількість mortal wounds, ваш опонент кидає кубики, щоб визначити цю кількість, як зазвичай).",
  "dread-talons/Pitiless Hunters":
    "ЦІЛЬ: Один підрозділ HERETIC ASTARTES INFANTRY з вашої армії, що не був обраний для стрільби цієї фази.\n\nЕФЕКТ: До кінця фази щоразу, коли модель вашого підрозділу здійснює атаку, спрямовану на підрозділ, що є Battle-shocked та/або Below Half-strength, ви можете перекинути Hit roll і ви можете перекинути Wound roll.",
  "dread-talons/Depthless Cruelty":
    "ЦІЛЬ: Один підрозділ HERETIC ASTARTES INFANTRY з вашої армії, що не був обраний для бою цієї фази.\n\nЕФЕКТ: До кінця фази щоразу, коли модель вашого підрозділу здійснює атаку, спрямовану на підрозділ, що є Battle-shocked та/або Below Half-strength, покращуйте характеристику Armour Penetration цієї атаки на 1.",
  "dread-talons/Bloody Example":
    "ЦІЛЬ: Цей підрозділ HERETIC ASTARTES.\n\nЕФЕКТ: Кожен ворожий підрозділ у межах 12\" від вашого підрозділу та видимий йому повинен пройти Battle-shock test.",
  "dread-talons/Merciless Pursuit":
    "ЦІЛЬ: Один підрозділ HERETIC ASTARTES INFANTRY з вашої армії, що не перебуває в межах Engagement range одного або більше ворожих підрозділів.\n\nЕФЕКТ: Оберіть один ворожий підрозділ, що здійснив Fell Back цього ходу і перебуває в межах 6\" від вашого підрозділу. Ваш підрозділ може оголосити charge, наче це ваша Charge phase. При цьому ви можете обрати ціллю цього charge лише цей ворожий підрозділ (і лише якщо він є прийнятною ціллю). Зверніть увагу, що навіть якщо цей charge успішний, ваш підрозділ не отримує жодного Charge bonus цього ходу.",
  "dread-talons/Screaming Descent":
    "ЦІЛЬ: Один підрозділ HERETIC ASTARTES JUMP PACK з вашої армії, що перебуває в Reserves.\n\nЕФЕКТ: Розставте свій підрозділ будь-де на полі бою на відстані понад 6\" по горизонталі від усіх ворожих підрозділів, але до кінця ходу він не має права оголошувати charge. Потім оберіть один ворожий підрозділ INFANTRY або MOUNTED у межах 9\" від вашого підрозділу та видимий йому: цей підрозділ повинен пройти Battle-shock test.",
  "dread-talons/Relentless Terror":
    "ЦІЛЬ: Цей підрозділ HERETIC ASTARTES INFANTRY.\n\nЕФЕКТ: До кінця ходу ваш підрозділ має право оголошувати charge в хід, коли він здійснив Fell Back.",
  "fellhammer-siege-host/Persistent Assailants":
    "ЦІЛЬ: Один підрозділ HERETIC ASTARTES з вашої армії, що був обраний ціллю однієї або більше атак цієї фази і не був обраний для бою цієї фази.\n\nЕФЕКТ: До кінця фази щоразу, коли модель вашого підрозділу здійснює атаку, ви можете перекинути Hit roll, а якщо ваш підрозділ Below Half-strength, ви також можете перекинути Wound roll.",
  "fellhammer-siege-host/Pitiless Cannonade":
    "ЦІЛЬ: Один підрозділ HERETIC ASTARTES з вашої армії, що не був обраний для стрільби цієї фази.\n\nЕФЕКТ: До кінця фази щоразу, коли модель вашого підрозділу здійснює атаку, спрямовану на підрозділ, що є Below Half-strength, успішний немодифікований Hit roll 5+ вважається Critical Hit",
  "fellhammer-siege-host/Point-Blank Destruction":
    "ЦІЛЬ: Один підрозділ HERETIC ASTARTES з вашої армії, що перебуває в межах Engagement Range одного або більше ворожих підрозділів і не був обраний для стрільби цієї фази.\n\nЕФЕКТ: До кінця фази дальня зброя вашого підрозділу (за винятком зброї Blast) має здатність [PISTOL].",
  "fellhammer-siege-host/Brutal Attrition":
    "ЦІЛЬ: Один підрозділ HERETIC ASTARTES INFANTRY з вашої армії (за винятком підрозділів DAMNED), що був обраний ціллю однієї або більше атак атакуючого підрозділу.\n\nЕФЕКТ: До кінця фази щоразу, коли атака ближнього бою розподіляється на ваш підрозділ, після того, як атакуючий підрозділ завершить здійснення своїх атак, киньте один D6 (максимум шість D6 на один атакуючий підрозділ): за кожен 4+ атакуючий підрозділ отримує 1 mortal wound.",
  "fellhammer-siege-host/Siegecraft":
    "ЦІЛЬ: Один підрозділ HERETIC ASTARTES з вашої армії.\n\nЕФЕКТ: До кінця фази щоразу, коли ворожий підрозділ обирає ваш підрозділ ціллю charge, віднімайте 2 від Charge roll (це не сумується з будь-якими іншими негативними модифікаторами до цього Charge roll).",
  "fellhammer-siege-host/Steadfast Determination":
    "ЦІЛЬ: Один підрозділ HERETIC ASTARTES з вашої армії (за винятком підрозділів DAMNED), що був обраний ціллю однієї або більше атак атакуючого підрозділу.\n\nЕФЕКТ: До кінця фази моделі вашого підрозділу мають здатність Feel No Pain 5+.",
};
